sterentev/atdf-device-asm-include/inc/ATmega8515.inc
; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 17
.equ	INT_VECTORS_SIZE	= 0x22
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	4	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	5	TIMER1_COMPB	; Timer/Counter1 Compare MatchB
;	6	TIMER1_OVF	; Timer/Counter1 Overflow
;	7	TIMER0_OVF	; Timer/Counter0 Overflow
;	8	SPI_STC		; Serial Transfer Complete
;	9	USART_RX	; USART, Rx Complete
;	10	USART_UDRE	; USART Data Register Empty
;	11	USART_TX	; USART, Tx Complete
;	12	ANA_COMP	; Analog Comparator
;	13	INT2		; External Interrupt Request 2
;	14	TIMER0_COMP	; Timer 0 Compare Match
;	15	EE_RDY		; EEPROM Ready
;	16	SPM_RDY		; Store Program Memory Ready


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare MatchB
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - Serial Transfer Complete
;#		reti			; USART_RX	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TX	 - USART, Tx Complete
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; TIMER0_COMP	 - Timer 0 Compare Match
;#		rjmp	INT_EE_RDY	; EE_RDY	 - EEPROM Ready
;#		reti			; SPM_RDY	 - Store Program Memory Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA8515_INC_ */

; ************************ END OF FILE *********************************

